<a href="https://colab.research.google.com/github/Sony-Dodla/b23_1666/blob/main/LAB_04(CW).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
data=[10,20,30,40,50]
series=pd.Series(data)
print("Pandas Series")
print(series)

Pandas Series
0    10
1    20
2    30
3    40
4    50
dtype: int64

##series with custom index

In [2]:
import pandas as pd
data=[10,20,30,40,50]
index_labels=['a','b','c','d','e']
series=pd.Series(data,index=index_labels)
print("Pandas Series")
print(series)

Pandas Series
a    10
b    20
c    30
d    40
e    50
dtype: int64

##creating a dataframe

In [3]:
import pandas as pd
data={
    'name':['alice','bob','charlie','david'],
    'age':[25,30,35,40],
    'city':['hyderabad','delhi','chennai','mumbai']
}
df=pd.DataFrame(data)
print(df)

      name  age       city
0    alice   25  hyderabad
1      bob   30      delhi
2  charlie   35    chennai
3    david   40     mumbai

##basic dataframe operations a) accessing data

In [4]:
print(df['name'])
print(df[['name','city']])
print(df.iloc[1])
print(df.loc[2])

0      alice
1        bob
2    charlie
3      david
Name: name, dtype: object
      name       city
0    alice  hyderabad
1      bob      delhi
2  charlie    chennai
3    david     mumbai
name      bob
age        30
city    delhi
Name: 1, dtype: object
name    charlie
age          35
city    chennai
Name: 2, dtype: object

In [5]:
df['salary']=[40000,50000,60000,70000]
print(df)

      name  age       city  salary
0    alice   25  hyderabad   40000
1      bob   30      delhi   50000
2  charlie   35    chennai   60000
3    david   40     mumbai   70000

In [6]:
df=df.drop('city',axis=1)
print(df)

      name  age  salary
0    alice   25   40000
1      bob   30   50000
2  charlie   35   60000
3    david   40   70000

##filtering the data

In [7]:
print(df[df['age']>30])

      name  age  salary
2  charlie   35   60000
3    david   40   70000

##basic statistics

In [8]:
print(df['age'].mean())
print(df['age'].max())
print(df['age'].min())

32.5
40
25

##Real world example :student data

In [19]:
import pandas as pd

student_data={
    'student_id':[101,102,103,104],
    'name':['sony','harshitha','amulya','rishitha'],
    'marks':[85,90,95,98],
    'department':['cse','ece','eee','civil']
}

student_df = pd.DataFrame(student_data)

print("Student Data Dictionary:")
print(student_data)
print("\nOriginal DataFrame (df):")
print(df)
print("\nStudent DataFrame (student_df):")
print(student_df)

print("\nstudents with marks>80:")
print(student_df[student_df['marks']>80])

print("\nstudents from cse department:")
print(student_df[student_df['department']=='cse'])

# Corrected code to add the 'result' column
student_df['result'] = ['pass' if x >= 40 else 'fail' for x in student_df['marks']]
print("\nStudent DataFrame with result column:")
print(student_df)

Student Data Dictionary:
{'student_id': [101, 102, 103, 104], 'name': ['sony', 'harshitha', 'amulya', 'rishitha'], 'marks': [85, 90, 95, 98], 'department': ['cse', 'ece', 'eee', 'civil']}

Original DataFrame (df):
   student_id       name  marks department
0         101       sony     85        cse
1         102  harshitha     90        ece
2         103     amulya     95        eee
3         104   rishitha     98      civil

Student DataFrame (student_df):
   student_id       name  marks department
0         101       sony     85        cse
1         102  harshitha     90        ece
2         103     amulya     95        eee
3         104   rishitha     98      civil

students with marks>80:
   student_id       name  marks department
0         101       sony     85        cse
1         102  harshitha     90        ece
2         103     amulya     95        eee
3         104   rishitha     98      civil

students from cse department:
   student_id  name  marks department
0         101  sony     85        cse

Student DataFrame with result column:
   student_id       name  marks department result
0         101       sony     85        cse   pass
1         102  harshitha     90        ece   pass
2         103     amulya     95        eee   pass
3         104   rishitha     98      civil   pass